Repository: die-wegmeister/Wegmeister.DatabaseStorage
Catalog: Resources/Private/Translations/*/Main.xlf
Languages: de

# storage.databaseStorage
source: Database Storage
de: Datenbank-Speicher

# storage.databaseStorageDescription
source: List database storage entries
de: Zeige Einträge des Datenbank-Speichers

# storage.datetime
source: Datetime
de: Zeitstempel

# storage.noEntries
source: No entries yet.
de: Noch keine Einträge vorhanden.

# storage.backToIdentifiers
source: Back to list of identifiers
de: Zurück zur Liste der vorhandenen IDs

# storage.flashmessage.entryRemoved
source: Entry successfully removed.
de: Eintrag erfolgreich entfernt.

# storage.flashmessage.entriesRemoved
source: Entries successfully removed.
de: Einträge erfolgreich entfernt.

# storage.identifier
source: Identifier
de: ID

# storage.export
source: Export entries of identifier '{0}'
de: Einträge von ID '{0}' exportieren

# storage.exportModal.title
source: Please select the file type for the export
de: Bitte wählen Sie den gewünschten Dateityp für den Export aus

# storage.exportModal.text
source: This will export all entries for identifier "{0}" to a file of the selected output format.
de: Hierdurch wird ein Download mit allen Einträgen für die ID "{0}" im gewünschten Dateityp erstellt.

# storage.includeDatetime
source: Include datetime in export
de: Zeitstempel des Eintrags ausgeben

# storage.exportAs
source: Export as
de: Exportieren als

# storage.exportAsFiletype
source: Export as {0}
de: Als {0} exportieren

# storage.deleteModal.title
source: Do you really want to delete all entries of identifier "{0}"?
de: Wollen Sie wirklich alle Einträge der ID "{0}" löschen?

# storage.deleteModal.text
source: This will delete all entries for identifier "{0}" and cannot be undone. Your data will be gone!
de: Hierdurch werden alle Einträge der ID "{0}" entgültig gelöscht. Dieser Vorgang kann nicht rückgangig gemacht werden.

# storage.deleteModal.removeAttachedResources
source: Remove attached resources
de: Zugehörige Dateien löschen

# storage.deleteModal.buttonTitle
source: Delete entries
de: Einträge löschen

# storage.deleteModal.buttonText
source: Yes, delete all entries for identifier "{0}"
de: Ja, alle Einträge für ID "{0}" löschen

# storage.entriesForX
source: Entries for identifier "{0}"
de: Einträge für ID "{0}"

# storage.deleteSingleModal.title
source: Do you really want to delete the selected entry?
de: Wollen Sie den gewählten Eintrag wirklich löschen?

# storage.deleteSingleModal.text
source: This will delete the entry and cannot be undone. The data for this entry will be gone!
de: Hierdurch wird der Eintrag entgültig gelöscht. Dieser Vorgang kann nicht rückgangig gemacht werden.

# storage.deleteSingleModal.buttonTitle
source: Delete entry
de: Eintrag löschen

# storage.deleteSingleModal.buttonText
source: Yes, delete entry
de: Ja, Eintrag löschen

# storage.deleteAll.deleteEntries
source: Delete entries
de: Einträge löschen

# storage.deleteAll.successTitle
source: Entries successfully removed
de: Einträge erfolgreich gelöscht

# storage.deleteAll.successText
source: All ({0}) entries for the identifier "{1}" were successfully removed.
de: Alle ({0}) Einträge der ID "{1}" wurden erfolgreich gelöscht.

# storage.deleteAll.back
source: Back to overview
de: Zurück zur Übersicht
